---
type: FlexPipe
namespace: Autodesk.Revit.DB.Plumbing
version: 2024
members: 9
tags: [revit-api, class]
---

# FlexPipe

`Autodesk.Revit.DB.Plumbing.FlexPipe` · Revit 2024 · 9 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | — | `` |
| Method | IsFlexPipeTypeId | 2014 | `public static bool IsFlexPipeTypeId ( Document document , ElementId pipeTypeId )` |
| Method | IsPipingSystemTypeId | 2014 | `public static bool IsPipingSystemTypeId ( Document document , ElementId systemTypeId )` |
| Property | EndTangent | 2014 | `public XYZ EndTangent { get ; set ; }` |
| Property | FlexPipeType | — | `public FlexPipeType FlexPipeType { get ; set ; }` |
| Property | FlowState | — | `public PipeFlowState FlowState { get ; }` |
| Property | Parameter | — | `` |
| Property | Points | — | `public IList < XYZ > Points { get ; set ; }` |
| Property | StartTangent | 2014 | `public XYZ StartTangent { get ; set ; }` |